//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************
//******************************************************************************
// [File] XCradleBmcLanConfig.uni
// [Description] TSE string defination.
// [Author] AMIJN
// [Date] 2020/12/01
//******************************************************************************
//
// @file BmcUserSettings.uni
//
//  String definitions for the BMC User settings
//
//#include "VFR.uni"
#langdef   en-US "English"    // English
#langdef   x-UEFI-AMI "x-UEFI-AMI"    // AMI Mapping Language
#langdef   zh-chs "中文 (简体)"  //XCradle-ZZP20210225V001-Add

#string STR_NULL_STRING                               #language en-US ""
#string STR_BMC_NETWORK_TITLE                         #language en-US "BMC network configuration"
                                                      #language zh-chs "BMC 网络配置"
#string STR_BMC_NETWORK_HELP                          #language en-US "Configure BMC network parameters"
                                                      #language zh-chs "配置BMC网络参数"
#string STR_OEM_BMC_IPV6_TITLE                        #language en-US "BMC IPV6 Network configuration"
                                                      #language zh-chs "BMC IPV6网络配置"
#string STR_OEM_BMC_IPV6_HELP                         #language en-US "BMC IPV6 Network configuration"
                                                      #language zh-chs "BMC IPV6网络配置"
#string STR_MANUAL                                    #language en-US "Manual"
                                                      #language zh-chs "手动"
#string STR_OEM_PCIE                                  #language en-US ""
#string STR_BMC_STATION_IP_HELP                       #language en-US  "Station IP address from BMC"
#string STR_STATION_IP_ADDRESS                        #language en-US "Station IP address"
                                                      #language zh-chs "配置IP地址"
#string STR_BMC_SUBNET_MASK_HELP                      #language en-US  "Subnet mask from BMC"
#string STR_SUBNET_MASK                               #language en-US "Subnet mask"
                                                      #language zh-chs "子网掩码"
#string STR_BMC_STATION_MAC_ADDRESS                   #language en-US  "Station MAC address from BMC"
#string STR_STATION_MAC_ADDRESS                       #language en-US "Station MAC address"
                                                      #language zh-chs "配置MAC地址"
#string STR_BMC_ROUTER_IP_HELP                        #language en-US  "Router IP address from BMC"
#string STR_ROUTER_IP_ADDRESS                         #language en-US "Router IP address"
                                                      #language zh-chs "路由IP地址"
#string STR_BMC_IPV6_ADDRESS_STATUS_ACTIVE            #language en-US "Active"
#string STR_BMC_IPV6_ADDRESS_STATUS_DISABLE           #language en-US "Disabled"
#string STR_BMC_IPV6_ADDRESS_STATUS_PENDING           #language en-US "Pending"
#string STR_BMC_IPV6_ADDRESS_STATUS_FAILED            #language en-US "Failed"
#string STR_BMC_IPV6_ADDRESS_STATUS_DEPRECATED        #language en-US "Deprecated"
#string STR_BMC_IPV6_ADDRESS_STATUS_INVALID           #language en-US "Invalid"
#string STR_BMC_IPV6_ADDRESS_STATUS_RESERVED          #language en-US "Reserved"
#string STR_IPSOURCE_STATIC_ADDRESS                   #language en-US "StaticAddress"
                                                      #language zh-chs "静态地址"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_DHCP         #language en-US "DynamicAddressBmcDhcp"
                                                      #language zh-chs "BMCDhcp动态地址"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BIOS_DHCP        #language en-US "DynamicAddressBiosDhcp"
#string STR_IPSOURCE_DYNAMIC_ADDRESS_BMC_NON_DHCP     #language en-US "DynamicAddressBmcNonDhcp"
#string STR_STATION_IP6_LAN_DHCP_DHCP6                #language en-US "DHCPv6"
#string STR_STATION_IP6_LAN_DHCP_SLAAC                #language en-US "SLAAC"
#string STR_BMCLAN_ERROR_INFO                         #language en-US "BMCLAN ERROR INFO"
                                                      #language zh-chs "BMCLAN 错误信息"
#string STR_INVALID_STATION_IP                        #language en-US "Invalid Station Ip Entered!!!"
                                                      #language zh-chs "无效的IP输入"
#string STR_INVALID_BMC_IPV6_ADDRESS                  #language en-US "Invalid Station Ipv6 value Entered!!!"
                                                      #language zh-chs "无效的IPv6值输入"
#string STR_INVALID_SUBNETMASK                        #language en-US "Invalid Subnet Mask Entered!!!"
                                                      #language zh-chs "无效的子网掩码输入"
#string STR_INVALID_ROUTER_IP                         #language en-US "Invalid Router Ip Entered!!!"
                                                      #language zh-chs "无效的路由IP输入"
#string STR_BIOS_STATIC                               #language en-US "Static"
                                                      #language zh-chs "静态"
#string STR_BMC_DYNAMIC                               #language en-US "DynamicBmcDhcp"
                                                      #language zh-chs "动态BMCDhcp"
#string STR_STATION_IP_HELP                           #language en-US "Enter station IP address"
                                                      #language zh-chs "输入IP地址"
#string STR_STATION_IP_ADDRESS_DEFAULT                #language en-US "0.0.0.0"
#string STR_SUBNET_MASK_DEFAULT                       #language en-US "0.0.0.0"
#string STR_ROUTER_IP_ADDRESS_DEFAULT                 #language en-US "0.0.0.0"
#string STR_STATION_IP6_ADDRESS_DEFAULT               #language en-US ":::::::"
#string STR_SUBNET_MASK_HELP                          #language en-US "Enter subnet mask"
                                                      #language zh-chs "输入子网掩码"
#string STR_ROUTER_IP_HELP                            #language en-US "Enter router IP address"
                                                      #language zh-chs "输入路由IP地址"
#string STR_STATION_IP6_HELP                          #language en-US "Enter station IPV6 address"
                                                      #language zh-chs "输入IPV6地址"
#string STR_STATION_IP6_ADDRESS_PREFIX_LENGTH_HELP    #language en-US "Change the prefix length"
                                                      #language zh-chs "修改前缀长度"
#string STR_STATION_IP6_ROUTER_ADDRESS_HELP           #language en-US "Change the IPV6 Router1 IP Address"
                                                      #language zh-chs "改变IPV6路由器1 IP 地址"
#string STR_UNKNOWN_STRING                            #language en-US "-"
#string STR_STATION_DEDICATED_IP6_LAN1_ADD_STATUS     #language en-US "-"
#string STR_STATION_SHARELINK_IP6_LAN1_ADD_STATUS     #language en-US "-"
#string STR_STATION_DEDICATED_IP6_LAN1_DHCP_ALGO      #language en-US "-"
#string STR_STATION_SHARELINK_IP6_LAN1_DHCP_ALGO      #language en-US "-"
#string STR_STATION_SHARELINK_IP6_ROUTER_ADDRESS1_VAL #language en-US "-"
#string STR_STATION_DEDICATED_IP6_ROUTER_ADDRESS1_VAL #language en-US "-"
#string STR_IP6_CURR_SHARELINK_LANCAS1_VAL            #language en-US "-"
#string STR_IP6_CURR_DEDICATED_LANCAS1_VAL            #language en-US "-"
#string STR_STATION_SHARELINK_IP6_LAN1_VAL            #language en-US "-"
#string STR_STATION_DEDICATED_IP6_LAN1_VAL            #language en-US "-"
#string STR_STATION_DEDICATED_IP6_LAN1_PREFIX_LENGTH_VAL        #language en-US "-"
#string STR_STATION_SHARELINK_IP6_LAN1_PREFIX_LENGTH_VAL        #language en-US "-"
#string STR_LAN_OPTION                                #language en-US "Address source"
                                                      #language zh-chs "地址资源"
#string STR_LAN_OPTION_HELP                           #language en-US "Select to configure LAN channel parameters statically or dynamically(by BIOS or BMC). Unspecified option will not modify any BMC network parameters during BIOS phase"
                                                      #language zh-chs "选择配置静态或动态网络通道参数(通过BIOS或BMC).未指定选项在BIOS阶段将不修改任何BMC网络参数"
#string STR_OEM_OCP                                   #language en-US ""
#string STR_OEM_LOM1                                  #language en-US ""
#string STR_OEM_LOM2                                  #language en-US ""
#string STR_BMC_SHARELINK_SUPPORT                     #language en-US "Sharelink Support"
                                                      #language zh-chs "共享网络支持"
#string STR_BMC_SHARELINK_SUPPORT_HELP                #language en-US "Sharelink Support Help"
                                                      #language zh-chs "共享网络支持帮助"
#string STR_BMC_SHARELINK_SELECT                      #language en-US "Sharelink Select"
                                                      #language zh-chs "共享网络选择"
#string STR_BMC_SHARELINK_SELECT_HELP                 #language en-US "Sharelink Select Help"
                                                      #language zh-chs "共享网络选择帮助"
#string STR_BMC_SHARELINK_NETWORK_SELECT              #language en-US "BMC Network Select"
                                                      #language zh-chs "BMC网络选择"
#string STR_BMC_SHARELINK_NETWORK_SELECT_HELP         #language en-US "BMC Network Select Help"
                                                      #language zh-chs "BMC网络选择帮助"
#string STR_BMC_SHARELINK_TITLE                       #language en-US "BMC Network Type"
                                                      #language zh-chs "BMC网络类型"
#string STR_BMC_SHARELINK1_TITLE                      #language en-US "BMC Network Type 1"
#string STR_BMC_DEDICATED_TYPE                        #language en-US ""
#string STR_BMC_SHARELINK_TYPE                        #language en-US "Sharelink"
#string STR_BMC_SHARELINK_HELP                        #language en-US "Configure NCSI Type parameters 0"
#string STR_BMC_SHARELINK1_HELP                       #language en-US "Configure NCSI Type parameters 1"
#string STR_BMC_SHARELINK_MODE_TITLE                  #language en-US "NCSI Mode"
#string STR_BMC_SHARELINK_MODE_HELP                   #language en-US "Configure NCSI Mode parameters"
#string STR_AUTO_FAILOVER_MODE                        #language en-US "Auto"
                                                      #language zh-chs "自动"
#string STR_MANUAL_SWITCH_MODE                        #language en-US "Manual"
                                                      #language zh-chs "手动"
#string STR_OEM_SHARELINK_CHANNELNO                   #language en-US "BMC Network Channel"
#string STR_OEM_SHARELINK_CHANNELNO1                  #language en-US "BMC Network Channel 1"
#string STR_OEM_SHARELINK_CHANNELNO_HELP              #language en-US "BMC Network Channel HELP 0"
#string STR_OEM_SHARELINK_CHANNELNO1_HELP             #language en-US "BMC Network Channel HELP 1"
#string STR_OEM_SHARELINK_ETH0                        #language en-US "Eth0"
#string STR_OEM_SHARELINK_ETH1                        #language en-US "Eth1"
#string STR_OEM_DEDICATED_NET                         #language en-US "BMC Dedicated Network Configuration"
                                                      #language zh-chs "BMC专用网络配置"
#string STR_OEM_DEDICATED_NET_HELP                    #language en-US "BMC Dedicated Network Configuration information"
                                                      #language zh-chs "BMC专用网络配置信息"
#string STR_OEM_SHARELINK_NET                         #language en-US "BMC Sharelink Network Configuration"
                                                      #language zh-chs "BMC共享网络配置"
#string STR_OEM_SHARELINK_NET_HELP                    #language en-US "BMC Sharelink Network Configuration information"
                                                      #language zh-chs "BMC共享网络配置信息"
#string STR_OEM_DEDICATED_IPV4                        #language en-US "Dedicated Ipv4 Network Configuration"
                                                      #language zh-chs "专用Ipv4网络配置"
#string STR_OEM_SHARELINK_IPV4                        #language en-US "Sharelink Ipv4 Network Configuration"
                                                      #language zh-chs "共享Ipv4网络配置"
#string STR_OEM_DEDICATED_IPV6                        #language en-US "Dedicated Ipv6 Network Configuration"
                                                      #language zh-chs "专用Ipv6网络配置"
#string STR_OEM_SHARELINK_IPV6                        #language en-US "Sharelink Ipv6 Network Configuration"
                                                      #language zh-chs "共享Ipv6网络配置"
#string STR_OEM_DEDICATED_PARAMETERS                  #language en-US "BMC Dedicated Network Parameters"
                                                      #language zh-chs "BMC专用网络参数"
#string STR_OEM_SHARELINK_PARAMETERS                  #language en-US "BMC Sharelink Network Parameters"
                                                      #language zh-chs "BMC共享网络参数"
#string STR_OEM_DEDICATED_PARAMETERS_HELP             #language en-US "BMC Dedicated Network Parameters Help"
                                                      #language zh-chs "BMC专用网络参数帮助"
#string STR_OEM_SHARELINK_PARAMETERS_HELP             #language en-US "BMC Sharelink Network Parameters Help"
                                                      #language zh-chs "BMC共享网络参数帮助"
#string STR_OEM_SHARELINK_FAILOVER_NIC_COUNT          #language en-US "Auto Failover Nic Count"
                                                      #language zh-chs "自动故障转移Nic计数"
#string STR_OEM_SHARELINK_FAILOVER_NIC_COUNT_HELP     #language en-US "1 = Only Dedicate or NCSI support Remote Mangement\n2 = Dedicate and one NCSI NIC support Remote Mangement"
#string STR_SHARELINK_STATION_IP1_VAL                 #language en-US  "-"
#string STR_SHARELINK_SUBNET_MASK1_VAL                #language en-US  "-"
#string STR_SHARELINK_STATION_MAC1_VAL                #language en-US  "-"
#string STR_SHARELINK_ROUTER_IP1_VAL                  #language en-US  "-"
#string STR_DEDICATED_STATION_IP1_VAL                 #language en-US  "-"
#string STR_DEDICATED_SUBNET_MASK1_VAL                #language en-US  "-"
#string STR_DEDICATED_STATION_MAC1_VAL                #language en-US  "-"
#string STR_DEDICATED_ROUTER_IP1_VAL                  #language en-US  "-"
#string STR_BMCLAN_ERROR_INPUT_INFO                   #language en-US "FORMAT ERROR!"
#string STR_PORT0                                     #language en-US "Port 0"
#string STR_PORT1                                     #language en-US "Port 1"
#string STR_PORT2                                     #language en-US "Port 2"
#string STR_PORT3                                     #language en-US "Port 3"
#string STR_PORT_ALL                                  #language en-US "All"
#string STR_SAVE_NETWORK_CONFIG                       #language en-US "Save Network Configuration"
                                                      #language zh-chs "保存网络配置"
#string STR_SAVE_NETWORK_CONFIG_HELP                  #language en-US "Send Network Configuration to BMC"
                                                      #language zh-chs "将网络配置发送到BMC"
#string STR_LAN_CHANNEL_1                             #language en-US "Lan channel 1"
#string STR_IPV6_OPTION_LAN1                          #language en-US "IPV6 Support"
                                                      #language zh-chs "IPV6支持"
#string STR_IPV6_OPTION_HELP_LAN1                     #language en-US "Enable or Disable LAN1 IPV6 Support"
                                                      #language zh-chs "启用或禁用 LAN1 IPV6 支持"
#string STR_IPV6_LAN1_OPTION                          #language en-US "Configuration Address source"
                                                      #language zh-chs "配置网络地址资源"
#string STR_UNSPECIFIED                               #language en-US "Unspecified"
                                                      #language zh-chs "未指定"
#string STR_STATION_IP6_ADDRESS_LAN1                  #language en-US "Station IPV6 address"
                                                      #language zh-chs "配置IPV6地址"
#string STR_STATION_IP6_ADDRESS_PREFIX_LENGTH_LAN1    #language en-US "Prefix Length"
                                                      #language zh-chs "前缀长度"
#string STR_STATION_IP6_ROUTER_ADDRESS_LAN1           #language en-US "IPV6 Router1 IP Address"
                                                      #language zh-chs "IPV6路由器1 IP 地址"
#string STR_CURR_STATION_IP6_ADDRESS                  #language en-US "Station IPV6 address"
                                                      #language zh-chs "配置IPV6地址"
#string STR_CURR_STATION_IP6_ADDRESS_PREFIX_LENGTH    #language en-US "Prefix Length"
                                                      #language zh-chs "前缀长度"
#string STR_CURR_STATION_IP6_ROUTER_ADDRESS           #language en-US "IPV6 Router1 IP Address"
                                                      #language zh-chs "IPV6路由器1 IP 地址"
#string STR_STATION_IP6_ADD_STATUS                    #language en-US "IPV6 address status"
                                                      #language zh-chs "IPV6地址状态"
#string STR_STATION_IP6_DHCP_ALGO                     #language en-US "IPV6 DHCP Algorithm"
                                                      #language zh-chs "IPV6 DHCP算法"
#string STR_IP6_BMC_NOT_SUPPORTED                     #language en-US "IPV6 is not supported in BMC (OR) IPV6 Support is Disabled."
#string STR_STATION_IP6_DHCP_ALGO_HELP                #language en-US "Providing the DHCP method used like DHCPv6 or StateLess Address Auto Configuration(SLAAC)."
#string STR_IP6_CURR_LAN_OPTION_HELP                  #language en-US "Current Ipv6 LAN Configuration statically or dynamically by BMC). Unspecified for not Configured address space"
#string STR_STATION_IP6_ADD_STATUS_HELP               #language en-US "Status of station IPV6 address to BMC."
#string STR_IP6_CURR_LAN_OPTION                       #language en-US "Current Configuration Address source"
                                                      #language zh-chs "当前配置网络地址资源"
#string STR_CURR_LAN_OPTION_HELP                      #language en-US "Current LAN Configuration statically or dynamically(by BIOS or BMC). Unspecified for not Configured address space"
#string STR_CURR_LAN_OPTION                           #language en-US "Current Configuration Address source"
                                                      #language zh-chs "当前配置网络地址资源"
#string STR_CURR_LANCAS1_VAL                          #language en-US  "-"
#string STR_SHARELINK_CURR_LANCAS1_VAL                #language en-US  "-"
#string SAVE_NETWORK_CONFIG                           #language en-US "Above option, if any changes, please click\n\"Save Network Configuration\" to send to BMC"
                                                      #language zh-chs "上面的选项,如有任何更改,请单击'保存网络配置'以发送到BMC"
#string SAVE_DEDICATED_SHARELINK_NETWORK_CONFIG       #language en-US "Exit the current interface and send changes to Address source/IP address/Subnet mask/Router IP to BMC"
                                                      #language zh-chs "退出当前界面，并将对地址源/ IP地址/子网掩码/路由器IP的更改发送到BMC"

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************